package JAVA_Season_2;

public class ex01_객체지향프로그래밍 {
    /*
    1. 클래스(Class)란?
        객체를 만들어 내기 위한 설계도 혹은 틀
        연관되어 있는 변수와 메서드의 집합
    2. 객체(Object)란?
        소프트웨어 세계에 구현할 대상
        클래스에 선언된 모양 그대로 생성된 실체
        <특징>
            - ‘클래스의 인스턴스(instance)’ 라고도 부른다.
            - 객체는 모든 인스턴스를 대표하는 포괄적인 의미를 갖는다.
            - oop의 관점에서 클래스의 타입으로 선언되었을 때 ‘객체’라고 부른다.
    3. 인스턴스(Instance)란?
        설계도를 바탕으로 소프트웨어 세계에 구현된 구체적인 실체
        즉, 객체를 소프트웨어에 실체화 하면 그것을 ‘인스턴스’라고 부른다.
        실체화된 인스턴스는 메모리에 할당된다.
        <특징>
            - 인스턴스는 객체에 포함된다고 볼 수 있다.
            - oop의 관점에서 객체가 메모리에 할당되어 실제 사용될 때 ‘인스턴스’라고 부른다.
            - 추상적인 개념(또는 명세)과 구체적인 객체 사이의 관계 에 초점을 맞출 경우에 사용한다.
                -- ‘~의 인스턴스’ 의 형태로 사용된다.
                -- 객체는 클래스의 인스턴스다.
                -- 객체 간의 링크는 클래스 간의 연관 관계의 인스턴스다.
                -- 실행 프로세스는 프로그램의 인스턴스다.
            - 즉, 인스턴스라는 용어는 반드시 클래스와 객체 사이의 관계로 한정지어서 사용할 필요는 없다.
            - 인스턴스는 어떤 원본(추상적인 개념)으로부터 ‘생성된 복제본’을 의미한다.

      객체 지향 프로그래밍
      = 추상화 / 모듈화 / 은닉 / 캡슐화 / 인터페이스 등의 개념이 매우 중요!
     */
}
